Updates to some ADRs
